export const AGE_GROUPS: string[] = [
  '20대',
  '30대',
  '40대',
  '50대',
  '60대',
  '70대 이상'
];

export const JOB_FUNCTIONS: string[] = [
  '경영/기획',
  '마케팅/홍보',
  '영업/고객관리',
  '재무/회계',
  '인사/총무',
  '생산/품질관리',
  '연구개발(R&D)',
  '디자인',
  'IT/개발',
  '물류/유통',
  '기타'
];

export const QUESTIONS: string[] = [
  '내가 이 일을 하는 이유는 즐거움을 느끼기 때문이다.',
  '내가 이 일을 하는 이유는 이 일이 중요한 의미가 있다고 생각하기 때문이다.',
  '내가 이 일을 하는 이유는 이 일이 개인적 목표를 성취하는데 도움이 될 거라고 생각하기 때문이다.',
  '내가 이 일을 하는 이유는 내가 이 일을 하지 않으면 나 자신은 물론, 내 주변의 가까운 사람들을 실망 시키게 될 것 같아서 이다.',
  '내가 이 일을 하는 이유는 이 일을 그만둔다면 재정 목표를 달성하지 못할 것 같기 때문이다.',
  '내가 이 일을 하는 이유를 알 수 없다.'
];

export const WEIGHTS: number[] = [
  10,    // 1번 문항
  5,     // 2번 문항
  1.66,  // 3번 문항
  -1.66, // 4번 문항
  -5,    // 5번 문항
  -10    // 6번 문항
];
